added interface IVersioned for contract name and version (#82)
* added interface IVersioned for contract name and version

* yieldTolerance added (#83)

* renaming: kRolesBase to kBaseRoles

* docs updated
